package com.example.flower;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.DividerItemDecoration;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import java.util.ArrayList;

public class flowers1 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_flowers1);


        ArrayList<flower1class> fl = new ArrayList<>();
        flower1class f1 = new flower1class("زهرة الزنبق", "زهرة الزنبق من النباتات المزهرة والمعمرة", "هناك مئات الأصناف من زهرة الزنبق حيث انه يمكن العثور عليه في الغالب في (أوروبا وآسيا وأمريكا الشمالية).", "ينمو معظم أنواعه في المناطق المعتدلة والاستوائية ، وعادة ما يسكن الغابات والمراعي والمستنقعات والجبال .", "وقت زراعتها في نهاية فصل الشتاء و بداية فصل الربيع .", "تزرع على عمق 15 سم و أكثر من سطح التربة.", R.drawable.f11);
        flower1class f2 = new flower1class("زهرة اللوتس", "زهرة اللوتس من النباتات المائية المعمرة", "تنمو في المياه الضحلة والموحلةوموطنها في جنوب آسيا وأستراليا وأكثرها شيوعا المزروعة في الحدائق المائية.", " تتمتع بأشعة الشمس الدافئة ولا تتحمل الطقس البارد.", "تزرع جذور زهرة اللوتس في تربة البركة أو أسفل النهر، بينما تطفو الأوراق فوق سطح الماء.", "ستخدم زهرة اللوتس أيضا في الطب التقليدي العشبي الآسيوي.", R.drawable.f23);
        flower1class f3 = new flower1class("زهرة النرجس", "تُعد زهرة النرجس من النباتات المُعمّرة", "يفضل النرجس التربة الجافة والبيئة ذات الشمس الخفيفة والظل و تفتّح زهورها في فصل الربيع، حيث إنها تتكون من الأوراق المُفلطحة التي تبدأ من قاعدة النَبتة.", "يجب أن يزرع النرجس في الخريف، وعلى عمق 15 سم في التربة,وعندما تزهر النبتة يفضل إبعادها عن الشمس وتهيئة الجو البارد لها.", "عند موت الزهره لا يتم إزالة أوراقها الميتة، وذلك لإنها تُساعد في إمداد البُصيلات بالطاقة للموسم القادم لازدهارها.", " يقتل أي نبات ينمو بجواره والنرجس نبات له أنواع كثيرة.", R.drawable.f4);
        flower1class f4 = new flower1class("زهرة دوار الشمس", "زهرة دوار الشمس هي نبتة بذور زيتية", "استعملها الهنود الحمر كدقيق للخبز والحصول علي زيتها الذي يحتوي على الأحماض الدهنية الأساسية ومعظمها دهون غير مشبعة. ", "يفيد في تخفيض الكولسترول بالدم. ويحوي فيتامين E وفولات ومغنيسيوم وزنك وحديد وفوسفور ونحاس وسيلينيوم, والزيت بهOmega-6 oil)) وهي لازمة لنمو الجسم ووظائفه ولا يصنعها. وبصفة عامة استهلاك زيوت أوميجا يمنع الأمراض ونقصها في الطعام يؤدي لأزمات قلبية وارتفاع في ضغط الدم ومرض السكر والتهاب المفاصل والسرطان. ", "يعد محصول زهرة الشمس ثالث أهم محصول زيتي في العالم كما أن بذور دوار الشمس تقلل الإصابة بأمراض سرطان الرئة .", "دأت زراعة محصول زهرة دوار الشمس تتسع في اليمن، بعد أن نجحت تجارب زراعته في عدد من المناطق والمحافظات، ووضعته أهميته الاقتصادية الدولية كمحصول نقد.", R.drawable.f5);
        flower1class f5 = new flower1class("زهرة الأقحوان", "زهرة الأقحوان ينتمي إلى من الفصيلة النجمية يضم حوالي 30 نوعاً من نباتات الزينة ذات الأهمية الاقتصادية", "عشبة يبلغ ارتفاعها (50 ـ 120 سم) لها ساق مضلعة عارية وقليلة الفروع، والأوراق مجنحة ومسننة وتفوح منها رائحة تشبه رائحة الكافور عند هرسهاما الأزهار فمستديرة في وسطها رأس نصف كروي أصفر اللون يتكون من زيت طيار. ", "يفيد في تخفيض الكولسترول بالدم. ويحوي فيتامين E وفولات ومغنيسيوم وزنك وحديد وفوسفور ونحاس وسيلينيوم, والزيت بهOmega-6 oil)) وهي لازمة لنمو الجسم ووظائفه ولا يصنعها. وبصفة عامة استهلاك زيوت أوميجا يمنع الأمراض ونقصها في الطعام يؤدي لأزمات قلبية وارتفاع في ضغط الدم ومرض السكر والتهاب المفاصل والسرطان. ", "حين يُزهر الأقحوان، تُجفّف أوراقه بهدف استخراج عنصر معروف بمزاياه الملطِّفة، لأنه غنيّ طبيعياً بمادة الستيرول النباتية، مركّبات نباتية قريبة من الكولستيرول الموجود في الجسم تتدخّل مباشرةً في عمليّة الدفاع عن البشرة عبر تنظيم آليات الالتهاب.", "تتمتّع زهرة الأقحوان بخصائص مضادّة للجراثيم والفطريات لأنها تحتوي على مادّتي الكاروتين والسابونين اللتين تنشّطان جهاز المناعة، وتُستعمل لمعالجة الحبوب، ولسعات الحشرات، وتُخلط زهرة الأقحوان مع المراهم أو تُدهن على الجروح، والجِلد المكشوط، وحتّى الندبات القديمة للاستفادة من مفعولها القويّ في التئام الجروح، كونها فاعلة ضد المكورات العنقودية.", R.drawable.f6);

        fl.add(f1);
        fl.add(f2);
        fl.add(f3);
        fl.add(f4);
        fl.add(f5);

        RecyclerView ah = findViewById(R.id.RecyclerView);
        ah.addItemDecoration(new DividerItemDecoration(this, DividerItemDecoration.VERTICAL));
        ah.setHasFixedSize(true);
        RecyclerView.LayoutManager y = new LinearLayoutManager(this);
        ah.setLayoutManager(y);
        adapterf o = new adapterf(fl, this);
        ah.setAdapter(o);

    }

}